from dotenv import load_dotenv
import os

# .env 불러오기
load_dotenv()

# API 키
AIRKOREA_API_KEY = os.getenv('AIRKOREA_API_KEY')
WEATHER_API_KEY = os.getenv('WEATHER_API_KEY')

# 수원시 구별 중심 좌표 (위도, 경도)
DISTRICT_COORDINATES = {
  '장안구': (37.3099, 127.0129),
  '권선구': (37.2575, 126.9726),
  '팔달구': (37.2843, 127.0305),
  '영통구': (37.2652, 127.0714)
}

# 미세먼지 등급 기준
PM10_GRADE = {
    '좋음': (0, 30.99998),
    '보통': (30.99999, 80.99998),
    '나쁨': (80.99999, 150.99998),
    '매우나쁨': (150.99999, 999)
}

# 초미세먼지 등급 기준
PM25_GRADE = {
    '좋음' : (0,14.99998),
    '보통' : (14.99999,34.99998),
    '나쁨' : (34.99999,74.99998),
    '매우나쁨' : (74.99999,999)
}

# 미세먼지 등급별 색상
GRADE_COLORS = {
    '좋음': '#32CD32',     # 초록
    '보통': '#FFD700',     # 노랑
    '나쁨': '#FF8C00',     # 주황
    '매우나쁨': '#FF0000'  # 빨강
}